import 'package:firebase_core/firebase_core.dart';
import 'package:flutter/cupertino.dart';
import 'package:lang_app/core/auth_service.dart';
import 'package:lang_app/core/database_service.dart';
import 'package:lang_app/models/article.dart';
import 'package:lang_app/models/article_tag.dart';
import 'package:lang_app/models/event_tag.dart';

Future<void> main() async {
  WidgetsFlutterBinding.ensureInitialized();
  await Firebase.initializeApp();
  var databaseService = DatabaseService();
  var authService = AuthService();
  authService.signInWithEmailAndPassword('nz54ds@gmail.com', 'password');

  String filler = 
"""
IT Arena — одна з наймасштабніших тех-конференцій Східної Європи. Подія пройде офлайн та об’єднає тех-експертів для обговорення найважливіших подій 2022 року в світі технологій та не тільки.

Попри війну, тех-спільнота України продовжує працювати, зростати та підтримувати економіку країни. В часи, коли країна зіткнулася з унікальними викликами та створює унікальні рішення, IT Arena 2022 стане однією з найбільших зустрічей лідерів технологічної галузі, експертів та всіх, хто стоїть на передовій цифрового майбутнього України.

Цього року IT Arena відбудеться офлайн, щоб показати силу та стійкість України, та зосередиться на таких темах:
- як тех-індустрія може підтримати країну в ці неспокійні часи,
- майбутньому військових технологій,
- сучасній кібертактиці під час війни та не тільки.

Серед учасників цьогорічної IT Arena — Олександр Борняков, заступник міністра цифрової трансформації України, а також представники влади. IT Arena вчергове надасть унікальну можливість лідерам тех-індустрії, українським та міжнародним медіа зібратися разом, щоб обговорити найактуальніші теми та дізнатися про сучасні технології.

## Два дні насичених дискусій

Спікерами IT Arena 2022 стануть Халук Байрактар, СЕО Baykar — турецької компанії-виробника безпілотних літальних апаратів, Кемерон Чел, CEO Dragonfly, Іван Толчинський, СЕО Atlas Aerospace, Сергій Притула, CEO Благодійного фонду Сергія Притули та Кім Зетер, експертка з кібербезпеки.

В межах цьогорічної конференції також відбудеться змагання кращих стартапів. Startup Competition надасть можливість молодим та перспективним тех-компаніям продемонструвати свої проєкти, випробувати бізнес-моделі, поспілкуватися з відомими підприємцями та інвесторами та позмагатися за призовий фонд у \$53 000. Реєстрація для участі в битві стартапів доступна до 11 вересня 2022 року за посиланням.

## Ваша безпека на події

Організатори IT Arena, разом з місцевою владою подбали про суворе дотримання заходів безпеки, щоб мінімізувати будь-які ризики під час проведення події. Саме тому, цього року подія виглядатиме дещо інакше та відбудеться у меншому масштабі.

«Ми доклали всіх зусиль, щоб створити максимально безпечне середовище, — каже Степан Веселовський, СЕО IT Arena та Львівського ІТ Кластера. «Незважаючи на безпрецедентні виклики, в 2022 році технічна спільнота в Україні продовжує розвиватися. Сьогодні думки наших партнерів, спікерів та учасників сходяться на тому, що ми повинні провести цю подію. Тож ми зберемося в офлайн-режимі, щоб показати всьому світу сміливість та стійкість України — країни, в якій, на наше переконання, життя може і має тривати.»

## Про подію

З 2014 року IT Arena збирає у Львові українську та світову тех-спільноту.

Щороку понад 5000 тех-професіоналів з більш ніж 40 країн світу відвідують IT Arena. Серед них, представники світових технологічних компаній, таких як Google, F1, Spotify, Tesla, а також українських стартапів, таких як Liki24, Legal Nodes, AXDRAFT.

Під час IT Arena учасники мають безліч можливостей дізнаватись про тренди тех-індустрії, встановити довгострокові ділові стосунки та поділитися ідеями про майбутнє технологій.

""";

String desc =  filler.substring(0, filler.indexOf('\n'));
  Article a = Article(filler);
    databaseService.sendArticle(a, EventTag('IT arena',"https://upload.wikimedia.org/wikipedia/commons/f/f4/Illuminated_sign_for_the_IT_Arena_in_Lviv_%2801%29.jpg", desc, DateTime(2022,9,30), DateTime(2022,10,1),'Lviv'));

}
